## PANDAS

* Panel Data
* Veri manipulasyonu ve veri analizi icin yazılmıs acık kaynak kodlu bir Python kutuphanesidir.
* Ekonometrik ve finansal calısmalar icin dogmustur.
* Temeli 2008 yılında atılmıstır.
* R icinde DataFrame yapısını Python dunyasına tasımıs ve DataFrame'ler uzerinde hızlı ve etkili calısabilme imkanı  
  saglamıştır.
* Bir cok farklı veri tipini okuma ve yazma imkanı saglar.

## Pandas Serisi Olusturmak

In [1050]:
import pandas as pd

In [1051]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [1052]:
seri = pd.Series([10,88,3,4,5])

In [1053]:
type(seri)

pandas.core.series.Series

In [1054]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [1055]:
seri.dtype

dtype('int64')

In [1056]:
seri.size

5

In [1057]:
seri.ndim

1

In [1058]:
seri.shape

(5,)

In [1059]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [1060]:
seri.head(3)                  #ilk 5 harfi istiyor

0    10
1    88
2     3
dtype: int64

In [1061]:
seri.tail(3)                  #sondan bakmaya yarıyor

2    3
3    4
4    5
dtype: int64

In [1062]:
#index isimlendirmesi

In [1063]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [1064]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [1065]:
pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [1066]:
seri = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [1067]:
seri["a"]

99

In [1068]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [1069]:
#sozluk uzerinden liste olusturmak

In [1070]:
sozluk = pd.Series({"reg":10, "log":11, "cart":12})

In [1071]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [1072]:
sozluk = {"reg":10, "log":11, "cart":12}

In [1073]:
seri = pd.Series(sozluk)

In [1074]:
seri

reg     10
log     11
cart    12
dtype: int64

In [1075]:
#iki seriyi birlestirerek seri olusturma

In [1076]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Eleman Islemleri

In [1077]:
import numpy as np
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [1078]:
seri[0]

1

In [1079]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [1080]:
seri = pd.Series([121,200,150,99], index= ["reg","loj","cart","rf"])

In [1081]:
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [1082]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [1083]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [1084]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [1085]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [1086]:
#eleman sorgulama

In [1087]:
"reg" in seri

True

In [1088]:
"a" in seri

False

In [1089]:
seri["reg"]

121

In [1090]:
#fancy eleman

In [1091]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [1092]:
seri["reg"] = 130

In [1093]:
seri["reg"]

130

In [1094]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

## Pandas DataFrame Olusturma

In [1095]:
l = [1,2,39,67,90]

In [1096]:
l

[1, 2, 39, 67, 90]

In [1097]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [1098]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [1099]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [1100]:
#df isimlendirme

In [1101]:
df = pd.DataFrame(m, columns =  ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [1102]:
df.columns = ["deg1","deg2","deg3"]

In [1103]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [1104]:
type(df)

pandas.core.frame.DataFrame

In [1105]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [1106]:
df.shape

(3, 3)

In [1107]:
df.ndim

2

In [1108]:
df.size

9

In [1109]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [1110]:
type(df.values)

numpy.ndarray

In [1111]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [1112]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [1113]:
a = np.array([1,2,3,4,5])

In [1114]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## DataFrame eleman islemleri

In [1115]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [1116]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}

In [1117]:
sozluk

{'var1': array([3, 0, 2, 1, 8]),
 'var2': array([5, 3, 0, 1, 5]),
 'var3': array([2, 7, 1, 5, 5])}

In [1118]:
df = pd.DataFrame(sozluk)

In [1119]:
df

   var1  var2  var3
0     3     5     2
1     0     3     7
2     2     0     1
3     1     1     5
4     8     5     5

In [1120]:
df[0:1]

   var1  var2  var3
0     3     5     2

In [1121]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [1122]:
df.index = ["a","b","c","d","e"]

In [1123]:
df

   var1  var2  var3
a     3     5     2
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1124]:
df["c":"e"]

   var1  var2  var3
c     2     0     1
d     1     1     5
e     8     5     5

In [1125]:
#silme

In [1126]:
df.drop("a", axis = 0)

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1127]:
df

   var1  var2  var3
a     3     5     2
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1128]:
df.drop("a", axis = 0, inplace = True)     #insplace: kalıcı bir sekilde siliyor.

In [1129]:
df

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1130]:
#fancy

In [1131]:
l = ["c","e"]

In [1132]:
df.drop(l, axis = 0)

   var1  var2  var3
b     0     3     7
d     1     1     5

In [1133]:
#degiskenler icin

In [1134]:
df

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1135]:
"var1" in df

True

In [1136]:
l = ["var1","var4","var2"]

In [1137]:
for i in l:
    print(i in df)

True
False
True

In [1138]:
df

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1139]:
df["var1"]

b    0
c    2
d    1
e    8
Name: var1, dtype: int32

In [1140]:
df["var4"] = df["var1"] / df["var2"]

In [1141]:
df

   var1  var2  var3  var4
b     0     3     7   0.0
c     2     0     1   inf
d     1     1     5   1.0
e     8     5     5   1.6

In [1142]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1143]:
df

   var1  var2  var3  var4
b     0     3     7   0.0
c     2     0     1   inf
d     1     1     5   1.0
e     8     5     5   1.6

In [1144]:
df.drop("var4", axis = 1, inplace = True)

In [1145]:
df

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

In [1146]:
l = ["var1","var2"]

In [1147]:
df.drop(l, axis = 1)

   var3
b     7
c     1
d     5
e     5

In [1148]:
df

   var1  var2  var3
b     0     3     7
c     2     0     1
d     1     1     5
e     8     5     5

# Gözlem Ve Degisken Secimi: loc & iloc

In [1149]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [1150]:
df

   var1  var2  var3
0     7    10    26
1    22    24    23
2    16    13    18
3    23    25    28
4    25    16     9
5    28    10    13
6    16     7    16
7     7    23    26
8    21    13    25
9    24     6     3

In [1151]:
?np.random.randint

In [1152]:
#loc: tanımlandıgı sekli ile secim yapmak icin kullanılır.

In [1153]:
df.loc[0:3]

   var1  var2  var3
0     7    10    26
1    22    24    23
2    16    13    18
3    23    25    28

In [1154]:
#iloc: alısık oldugumuz indeksleme mantıgı ile secim yapar.

In [1155]:
df.iloc[0:3]

   var1  var2  var3
0     7    10    26
1    22    24    23
2    16    13    18

In [1156]:
df.iloc[0,0]

7

In [1157]:
df

   var1  var2  var3
0     7    10    26
1    22    24    23
2    16    13    18
3    23    25    28
4    25    16     9
5    28    10    13
6    16     7    16
7     7    23    26
8    21    13    25
9    24     6     3

In [1158]:
df.iloc[:3,:2]

   var1  var2
0     7    10
1    22    24
2    16    13

In [1159]:
df.loc[0:3, "var3"]

0    26
1    23
2    18
3    28
Name: var3, dtype: int32

In [1160]:
df.iloc[0:3]["var3"]

0    26
1    23
2    18
Name: var3, dtype: int32

## Kosullu Eleman Islemleri

In [1161]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     9    11     1
1    22    10     3
2    10    18    13
3    11    12    23
4     7    29     6
5    16     7    13
6    28     2    11
7    17    16    26
8     3    20     3
9    12    21    13

In [1162]:
df["var1"]

0     9
1    22
2    10
3    11
4     7
5    16
6    28
7    17
8     3
9    12
Name: var1, dtype: int32

In [1163]:
df["var1"][0:2]

0     9
1    22
Name: var1, dtype: int32

In [1164]:
df[df.var1 > 15]

   var1  var2  var3
1    22    10     3
5    16     7    13
6    28     2    11
7    17    16    26

In [1165]:
df[(df.var1 > 20) & (df.var3 < 15)]

   var1  var2  var3
1    22    10     3
6    28     2    11

In [1166]:
df.loc[(df.var1 > 20), ["var1","var2"]]

   var1  var2
1    22    10
6    28     2

In [1167]:
df[(df.var1 > 10)][["var1","var2"]]

   var1  var2
1    22    10
3    11    12
5    16     7
6    28     2
7    17    16
9    12    21

# Birlestirme (Join) Islemleri

In [1168]:
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    13    15    15
1    29    19    15
2    10     7    11
3    19    26     3
4    27     9    24

In [1169]:
df2 = df1 + 99
df2

   var1  var2  var3
0   112   114   114
1   128   118   114
2   109   106   110
3   118   125   102
4   126   108   123

In [1170]:
pd.concat([df1, df2])

   var1  var2  var3
0    13    15    15
1    29    19    15
2    10     7    11
3    19    26     3
4    27     9    24
0   112   114   114
1   128   118   114
2   109   106   110
3   118   125   102
4   126   108   123

In [1171]:
?pd.concat

In [1172]:
pd.concat([df1,df2], ignore_index = True)     #index problemi ortadan kalktı.

   var1  var2  var3
0    13    15    15
1    29    19    15
2    10     7    11
3    19    26     3
4    27     9    24
5   112   114   114
6   128   118   114
7   109   106   110
8   118   125   102
9   126   108   123

# ileri Birlestirme Islemleri

In [1173]:
df1 = pd.DataFrame({'calisanlar': ['Ali','Veli','Ayse','Fatma'],
                  'grup': ['Muhasebe','Muhendislik','Muhendislik','IK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [1174]:
df2 = pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'],
                   'ilk_giris': [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [1175]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [1176]:
#coktan teke

In [1177]:
df3 = pd.merge(df1,df2)

In [1178]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [1179]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'IK'],
                   'mudur': ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [1180]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [1181]:
#coktan coka

In [1182]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe', 'Muhendislik', 'Muhendislik', 'IK', 'IK'],
                    'yetenekler': ['matematik', 'excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [1183]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [1184]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

# Toplulastırma ve Gruplama (Aggregation&Grouping)

Basit toplulastırma fonksiyonları:

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [1185]:
import seaborn as sns

In [1186]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [1187]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [1188]:
df.shape

(1035, 6)

In [1189]:
df.mean()                            #butun degiskenlerin ortalama degerini verdi.

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [1190]:
df["mass"].mean()

2.6381605847953216

In [1191]:
df["mass"].count()

513

In [1192]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

# Gruplama Islemleri

In [1193]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'veri': [10,11,52,23,43,55]}, columns = ['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [1194]:
df.groupby("gruplar")

In [1195]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [1196]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [1197]:
df.groupby("method")

In [1198]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

# ileri Toplulastırma Islemleri (Aggregate, filter, transform, apply)

In [1199]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                 'degisken1': [10,23,33,22,11,99],
                 'degisken2': [100,253,333,262,111,969]},
                columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [1200]:
#aggregate

In [1201]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [1202]:
df.groupby("gruplar").aggregate(["min", np.median, "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [1214]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                 'degisken1': [10,23,33,22,11,99],
                 'degisken2': [100,253,333,262,111,969]},
                columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [1204]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [1205]:
df.groupby("gruplar").std()

         degisken1
gruplar
A         8.485281
B         8.485281
C        46.669048

In [1206]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1 degisken2
2       C         33       NaN
5       C         99       NaN

In [1207]:
#transform

In [1215]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                 'degisken1': [10,23,33,22,11,99],
                 'degisken2': [100,253,333,262,111,969]},
                columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [1216]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [1217]:
df.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2 gruplar
0  -0.687871  -0.738461     NaN
1  -0.299074  -0.263736     NaN
2   0.000000  -0.015514     NaN
3  -0.328982  -0.235811     NaN
4  -0.657963  -0.704331     NaN
5   1.973890   1.957853     NaN

In [1218]:
#apply

In [1219]:
df = pd.DataFrame({
                 'degisken1': [10,23,33,22,11,99],
                 'degisken2': [100,253,333,262,111,969]},
                columns = ['degisken1', 'degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [1220]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [1221]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

# Pivot Tablolar

In [1222]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [1226]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [1229]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447